# 4.5 - Data Consistency Checks - Contents

1. Checking for and Addressing Mixed-Type Data
2. Checking for and Addressing Missing Values
3. Checking for and Addressing Duplicates

# Exercise 4.5 Follow Along

## Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

## Importing Data Set

In [2]:
# Assigning folder path
path = r'C:\Users\kaymi\OneDrive\Documents\05-2023-Instacart Basket Analysis'

In [3]:
path

'C:\\Users\\kaymi\\OneDrive\\Documents\\05-2023-Instacart Basket Analysis'

In [4]:
# Import Original Products csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [7]:
# Import Prepared Orders csv
df_ords_wrangled = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

## Mixed Type Data

In [8]:
# Create a datafram
df_test = pd.DataFrame()

In [9]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [10]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [12]:
# Check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

## Missing Values

In [13]:
# Find missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [14]:
# creating subset for missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [15]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [16]:
# Checking shape of df_prods
df_prods.shape

(49693, 5)

In [17]:
# Creating clean dataframe
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [18]:
# Checking shape of df_prods_clean
df_prods_clean.shape

(49677, 5)

# Duplicates

In [19]:
# Finding full duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [20]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [21]:
# Checking df_prods_clean shape
df_prods_clean.shape

(49677, 5)

In [22]:
# Create dataframe with no duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [23]:
# Checking shape of df_prods_clean_no_dups
df_prods_clean_no_dups.shape

(49672, 5)

# Exercise 4.5 Steps

## Task Step 1 - Descriptive Statistics

In [28]:
# Descriptive Statistics for df_prods
df_prods.describe()
# The price of 99,999 seems quite high for Instacart, and may be an error
# All other descriptive statistics performed in the exercise above

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [30]:
# Check 99,999 price - this seems to be an error
df_prods[df_prods.prices == 99999]

       product_id           product_name  aisle_id  department_id   prices
33666       33664  2 % Reduced Fat  Milk        84             16  99999.0

## Task Step 2 - Descriptive Statistics for df_ords

In [29]:
df_ords_wrangled.describe()
# Data looks fairly normal for

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Task Step 3 - df_ords mixted type data check

In [31]:
# Checking for mixed type data
for col in df_ords_wrangled.columns.tolist():
  weird = (df_ords_wrangled[[col]].applymap(type) != df_ords_wrangled[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords_wrangled[weird]) > 0:
    print (col)

In [32]:
# No mixed data columns found

## Task Step 4 - Fixing Mixed Data

In [35]:
# No mixed data columns founds

## Task Step 5 - Checking for Missing Values

In [36]:
df_ords_wrangled.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [40]:
# There are several missing values listed in the days_since_last_order, however this could be due to multiple orders placed in the same day, or any first time customers

In [41]:
# Creating subset for missing values
df_nan = df_ords_wrangled[df_ords_wrangled['days_since_last_order'].isnull() == True]

In [42]:
df_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [59]:
# It appears that the "days_since_last_order" values that are missing are due to the customer's first order

In [61]:
df_nan.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,2.062090e+05,2.062090e+05,206209.000000,206209.0,206209.000000,206209.000000,0.0
mean,1.712637e+06,1.708462e+06,103105.000000,1.0,2.754118,13.626597,NaN
std,9.874816e+05,9.881299e+05,59527.555167,0.0,2.076205,4.223769,NaN
min,0.000000e+00,2.000000e+01,1.000000,1.0,0.000000,0.000000,NaN
25%,8.579730e+05,8.507300e+05,51553.000000,1.0,1.000000,11.000000,NaN
50%,1.717068e+06,1.706246e+06,103105.000000,1.0,3.000000,14.000000,NaN
75%,2.570518e+06,2.564292e+06,154657.000000,1.0,5.000000,17.000000,NaN
max,3.421069e+06,3.421081e+06,206209.000000,1.0,6.000000,23.000000,NaN

In [62]:
# The min and max order number for all missing values is 1, so it is likely safe to assume these are first time customers

# Task Step 6 - Address Missing Values

In [48]:
# Replace missing value with "first order" tag
df_ords_wrangled['days_since_last_order'].fillna(value = 'first order', inplace=True)

In [52]:
df_ords_wrangled.head(20)

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,first order
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
5,5,3367565,1,6,2,7,19.0
6,6,550135,1,7,1,9,20.0
7,7,3108588,1,8,1,14,14.0
8,8,2295261,1,9,1,16,0.0
9,9,2550362,1,10,4,8,30.0
10,10,1187899,1,11,4,8,14.0
11,11,2168274,2,1,2,11,first order
12,12,1501582,2,2,5,10,10.0
13,13,1901567,2,3,1,10,3.0
14,14,738281,2,4,2,10,8.0
15,15,1673511,2,5,3,11,8.0
16,16,1199898,2,6,2,9,13.0
17,17,3194192,2,7,2,12,14.0
18,18,788338,2,8,1,15,27.0
19,19,1718559,2,9,2,9,8.0

In [47]:
df_ords_wrangled.isnull().sum()

Unnamed: 0               0
order_id                 0
user_id                  0
order_number             0
orders_day_of_week       0
order_hour_of_day        0
days_since_last_order    0
dtype: int64

## Task Step 7 - Check for Duplicate Values

In [55]:
# Finding full duplicates
df_ords_dups = df_ords_wrangled[df_ords_wrangled.duplicated()]

In [56]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

In [57]:
# No duplicates found

## Task Step 8 - Fixing Duplicates

In [58]:
# No duplicated found

## Task Step 9 - Exporting to Prepared Data Folder

In [63]:
# Exporting df_prods
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'prods_checked.csv'))

In [65]:
# Exporting df_ords_wrangled
df_ords_wrangled.to_csv(os.path.join(path,'02 Data','Prepared Data', 'ords_checked.csv'))